Revit 2027 API
BuiltInFailures.StairRampFailures.NoRisersInPureMonolithicStairs Property
 Monolithic Stairs with zero tread thickness can't have risers
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRisersInPureMonolithicStairs { get; }
Public Shared ReadOnly Property NoRisersInPureMonolithicStairs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRisersInPureMonolithicStairs {
	FailureDefinitionId^ get ();
}
static member NoRisersInPureMonolithicStairs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace